Repository: kirrishima/FluentDownloader
Catalog: src/FluentDownloader/Strings/*/Dialogs.resw
Source language: en_us
Languages: ru_ru

# NotificationDialogCloseButton
source: OK
ru_ru: Ок

# NotificationDialogPrimaryButtonText
source: Install
ru_ru: Установить

# NotificationDialogCloseButtonText
source: Do not install
ru_ru: Не устанавливать

# DependencyInfoVersion
source: Vesrion: {0}
ru_ru: Версия: {0}

# DependencyInfoPath
source: Path to {0}: "{1}"
ru_ru: Путь к {0}: "{1}"

# DependencyInfoRevealInExplorer
source: View In Explorer
ru_ru: Показать в проводнике

# FfmpegInfoTitle
source: Ffmpeg Info
ru_ru: Информация о Ffmpeg

# FfmpegInfoGithubLinkText
source: See GitHub page
ru_ru: Страница на GitHub

# YtdlpInfoTitle
source: yt-dlp Info
ru_ru: Информация о yt-dlp

# YtdlpInfoGithubLinkText
source: See GitHub page
ru_ru: Страница на GitHub

# InstallYtDlpDialogTitle.Text
source: YT-DLP Installation Required
ru_ru: Требуется установка YT-DLP

# InstallYtDlpDescriptionPart1.Text
source: This application requires
ru_ru: Для работы этого приложения требуется

# InstallYtDlpDescriptionPart3.Text
source: to function properly. You can download it by clicking the "Install" button or manually from the GitHub repository below:
ru_ru: . Вы можете скачать его, нажав кнопку "Установить", или вручную из репозитория GitHub ниже:

# YtDlpGithubReposNavigateUriText.Text
source: yt-dlp GitHub Repository
ru_ru: Репозиторий yt-dlp на GitHub

# InstallYtDlpDialogCaption.Text
source: After downloading yt-dlp, it should be added to the PATH.
ru_ru: После загрузки yt-dlp его необходимо добавить в PATH.

# InstallFfmpegDialogTitle.Text
source: FFmpeg Installation Required
ru_ru: Требуется установка FFmpeg

# InstallFfmpegDescriptionPart1.Text
source: This application requires
ru_ru: Для работы этого приложения требуется

# InstallFfmpegDescriptionPart3.Text
source: to download videos in high quality. You can download it by clicking the "Install" button or manually from the GitHub repository below:
ru_ru: для загрузки видео в высоком качестве. Вы можете скачать его, нажав кнопку "Установить", или вручную из репозитория GitHub ниже:

# FfmpegGithubReposNavigateUriText.Text
source: FFmpeg GitHub Repository
ru_ru: Репозиторий FFmpeg на GitHub

# InstallFfmpegNotePart1.Text
source: Since FFmpeg is an essential dependency,
ru_ru: Поскольку FFmpeg является важной зависимостью,

# InstallFfmpegNotePart3.Text
source: provides custom builds that you can use.
ru_ru: предоставляет собственные сборки, которые вы можете использовать.

# InstallFfmpegCaption.Text
source: After downloading FFmpeg, it should be added to the PATH.
ru_ru: После загрузки FFmpeg его необходимо добавить в PATH.

# InstallYtDlpAndFfmpegDialogTitle.Text
source: YT-DLP and FFmpeg Required
ru_ru: Требуется установка YT-DLP и FFmpeg

# InstallYtDlpAndFfmpegDescriptionPart1.Text
source: This application requires
ru_ru: Для работы этого приложения требуется

# InstallYtDlpAndFfmpegDescriptionPart3.Text
source: and
ru_ru: и

# InstallYtDlpAndFfmpegDescriptionPart5.Text
source: to function properly. Please download and install them from the following links:
ru_ru: . Пожалуйста, скачайте и установите их по следующим ссылкам:

# InstallYtDlpAndFfmpegInstructionPart1.Text
source: You can automatically download
ru_ru: Вы можете автоматически скачать

# InstallYtDlpAndFfmpegInstructionPart3.Text
source: and
ru_ru: и

# InstallYtDlpAndFfmpegInstructionPart5.Text
source: by clicking the "Install" button, or download them manually from the repositories.
ru_ru: , нажав кнопку "Установить", или скачать их вручную из репозиториев.

# InstallYtDlpAndFfmpegCaption.Text
source: After downloading yt-dlp and ffmpeg, each should be added to the PATH.
ru_ru: После загрузки yt-dlp и ffmpeg их необходимо добавить в PATH.

# InstallFfmpegAndYtdlpDialogTitle.Text
source: YT-DLP and FFmpeg Required
ru_ru: Необходимы YT-DLP и FFmpeg

# InstallFfmpegAndYtdlpDialogDescriptionPart1.Text
source: This application requires
ru_ru: Для работы приложения требуется

# InstallFfmpegAndYtdlpDialogDescriptionPart2.Text
source: This application requires
ru_ru: Для работы приложения требуется
